---
title: CurveFailures
classe: Autodesk.Revit.DB.BuiltInFailures+CurveFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# CurveFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotFindAreaScheme { get; }` | `CurveFailures.CannotFindAreaScheme` | FailureDefinitionId |
| `FailureDefinitionId CantKeepJoinTangent { get; }` | `CurveFailures.CantKeepJoinTangent` | FailureDefinitionId |
| `FailureDefinitionId CurveNotEditable { get; }` | `CurveFailures.CurveNotEditable` | FailureDefinitionId |
| `FailureDefinitionId CurveNotEditableWarn { get; }` | `CurveFailures.CurveNotEditableWarn` | FailureDefinitionId |
| `FailureDefinitionId InvalidCurveForElement { get; }` | `CurveFailures.InvalidCurveForElement` | FailureDefinitionId |
| `FailureDefinitionId LineTooShortError { get; }` | `CurveFailures.LineTooShortError` | FailureDefinitionId |
| `FailureDefinitionId LineTooShortWarning { get; }` | `CurveFailures.LineTooShortWarning` | FailureDefinitionId |
| `FailureDefinitionId PeriodicCurveBadParams { get; }` | `CurveFailures.PeriodicCurveBadParams` | FailureDefinitionId |
| `FailureDefinitionId SelfIntersectingSpline { get; }` | `CurveFailures.SelfIntersectingSpline` | FailureDefinitionId |
| `FailureDefinitionId TooShort { get; }` | `CurveFailures.TooShort` | FailureDefinitionId |
| `FailureDefinitionId TopLevelBelowBottomLevel { get; }` | `CurveFailures.TopLevelBelowBottomLevel` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```